# TransactionAttribute Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TransactionAttribute Constructor
TransactionAttribute Class See Also
---
Constructs a new TransactionAttribute.
**Namespace:** Autodesk.Revit.Attributes**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public TransactionAttribute(
	TransactionMode mode
)
```

Visual Basic
---
```text
Public Sub New ( _
	mode As TransactionMode _
)
```

Visual C++
---
```text
public:
TransactionAttribute(
	TransactionMode mode
)
```

# ### Parameters
mode
    Type: Autodesk.Revit.Attributes..::..TransactionMode
# See Also
TransactionAttribute Class
Autodesk.Revit.Attributes Namespace